Tekla Open API Reference for Tekla Structures 2025
DwgObject Constructor
Overload List
Name | Description
DwgObject(ViewBase, Point, String)
 Creates a new DwgObject instance with the given parameters.
DwgObject(ViewBase, Point, String, EmbeddedObjectAttributes)
 Creates a new DwgObject instance using the specified attributes.
DwgObject(ViewBase, Point, Size, String)
 Creates a new DwgObject instance with the given parameters.
DwgObject(ViewBase, Point, Size, String, EmbeddedObjectAttributes)
 Creates a new DwgObject instance using the specified attributes.
Top
See Also
Reference
DwgObject Class
Tekla.Structures.Drawing Namespace